#Область ОбработчикиСобытийЭлементовТаблицыФормыСтуденты

&НаКлиенте
Процедура СтудентыФормаОбученияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Студенты.ТекущиеДанные;
	ЭлементСуммаОбучения = Элементы.Студенты.ПодчиненныеЭлементы.СтудентыСуммаОбучения;
	
	Если ТекСтрока.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.Бюджет") Тогда
	
		ТекСтрока.СуммаОбучения = 0;
		ЭлементСуммаОбучения.Доступность = Ложь;
		
	Иначе
		
		ЭлементСуммаОбучения.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


