#Область ОбработчикиСобытийЭлементовТаблицыФормыСтуденты

&НаКлиенте
Процедура СтудентыФормаОбученияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Студенты.ТекущиеДанные;
	
	Если ТекСтрока.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.Бюджет") Тогда
	
		ТекСтрока.СуммаОбучения = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтудентыПриАктивизацииЯчейки(Элемент)
	
	ТекЭлемент = Элемент.ТекущийЭлемент;
	
	Если ТекЭлемент.Имя = "СтудентыСуммаОбучения" Тогда
		
		ТекСтрока = Элементы.Студенты.ТекущиеДанные;
		
		Если ТекСтрока.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.Бюджет") Тогда
			
			ТекЭлемент.ТолькоПросмотр = Истина;
			
		Иначе
			
			ТекЭлемент.ТолькоПросмотр = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
#КонецОбласти


