#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЦенуЗаОбучение(ЦенаЗаОбучение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФакультетПриИзменении(Элемент)
	
	ИзменитьЦеныНаОбучение(ЦенаЗаОбучение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтуденты

&НаКлиенте
Процедура СтудентыФормаОбученияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Студенты.ТекущиеДанные;
	
	Если ТекСтрока.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.Бюджет") Тогда
	
		ТекСтрока.СуммаОбучения = 0;
		
	Иначе
		
		ТекСтрока.СуммаОбучения = ЦенаЗаОбучение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтудентыПриАктивизацииЯчейки(Элемент)
	
	ТекЭлемент = Элемент.ТекущийЭлемент;
	
	Если ТекЭлемент.Имя = "СтудентыСуммаОбучения" Тогда
		
		ТекСтрока = Элементы.Студенты.ТекущиеДанные;
		
		Если ТекСтрока.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.Бюджет") Тогда
			
			ТекЭлемент.ТолькоПросмотр = Истина;
			
		Иначе
			
			ТекЭлемент.ТолькоПросмотр = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьЦеныНаОбучение(ЦенаЗаОбучение)
	
	Если Не ЗначениеЗаполнено(ЦенаЗаОбучение) Тогда
		
		ЗаполнитьЦенуЗаОбучение(ЦенаЗаОбучение);
		
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект.Студенты Цикл
		
		Если СтрокаТЧ.ФормаОбучения = Перечисления.ФормаОбучения.Платное Тогда
			
			СтрокаТЧ.СуммаОбучения = ЦенаЗаОбучение;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦенуЗаОбучение(ЦенаЗаОбучение)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныНаОбучениеСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНаОбучение.СрезПоследних(, Факультет = &Факультет) КАК ЦеныНаОбучениеСрезПоследних";
	
	Запрос.УстановитьПараметр("Факультет", Объект.Факультет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	ЦенаЗаОбучение = Выборка.Цена;
	
КонецПроцедуры

#КонецОбласти




