#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
	СтудентПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СтудентПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВзаиморасчетыОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Дата, Студент = &Студент) КАК ВзаиморасчетыОстатки";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Студент", Объект.Студент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	ДолгПоОбучению = Выборка.СуммаОстаток;

КонецПроцедуры

#КонецОбласти