#Область ПрограммныйИнтерфейс

// Сообщает о днях рождения студентов и сотрудников
Процедура СообщитьДниРождения() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.Наименование
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	МЕСЯЦ(Сотрудники.ДатаРождения) = МЕСЯЦ(&ТекДата)
	|	И ДЕНЬ(Сотрудники.ДатаРождения) = ДЕНЬ(&ТекДата)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Студенты.Наименование
	|ИЗ
	|	Справочник.Студенты КАК Студенты
	|ГДЕ
	|	МЕСЯЦ(Студенты.ДатаРождения) = МЕСЯЦ(&ТекДата)
	|	И ДЕНЬ(Студенты.ДатаРождения) = ДЕНЬ(&ТекДата)";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	
	ВыборкаЛюдей = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЛюдей.Следующий() Цикл
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = (СтрШаблон("Сегодня день рождения у %1", ВыборкаЛюдей.Наименование));
		Сообщение.Сообщить();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти