#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Проверка Курса
	МаксимальныйКурс = Константы.КоличествоКурсовУниверситета.Получить();
	
	Если Курс > МаксимальныйКурс Тогда
	
		Сообщение = Новый СообщениеПользователю();
		
		Сообщение.Текст = СтрШаблон("Ошибка! Указанный курс выше максимального - %1", МаксимальныйКурс);
		Сообщение.Поле = "Объект.Курс";
		
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
		
	//Создание ВТ со студентами
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЧСтуденты.НомерСтроки,
	|	ТЧСтуденты.Студент КАК Студент,
	|	ТЧСтуденты.Староста,
	|	ТЧСтуденты.ФормаОбучения,
	|	ТЧСтуденты.СуммаОбучения
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	&ТЧСтуденты КАК ТЧСтуденты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Студент";
	
	Запрос.УстановитьПараметр("ТЧСтуденты", Студенты);
	
	Запрос.Выполнить();
	
	//Проверка дублей студентов в ТЧ
	
	ЗапросДублейСтудентов = Новый Запрос;
	ЗапросДублейСтудентов.МенеджерВременныхТаблиц = МенеджерВТ;
	
	ЗапросДублейСтудентов.Текст = "ВЫБРАТЬ
	|	ДанныеДокумента.Студент
	|ПОМЕСТИТЬ ДублиСтудентов
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Студент
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ДанныеДокумента.Студент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДублиСтудентов.Студент КАК Студент,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ДублиСтудентов КАК ДублиСтудентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
	|		ПО ДублиСтудентов.Студент = ДанныеДокумента.Студент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Студент";
	
	ВыборкаДублей = ЗапросДублейСтудентов.Выполнить().Выбрать();
	
	Пока ВыборкаДублей.Следующий() Цикл
		
		Сообщение = Новый СообщениеПользователю();
		
		Сообщение.Текст = СтрШаблон("Студент %1 встречается в документе более одного раза!", 																				ВыборкаДублей.Студент);
		Сообщение.Поле 	= СтрШаблон("Студенты[%1].Студент", ВыборкаДублей.НомерСтроки - 1);
		
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.КлючДанных 	= Ссылка;
		
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЦикла;
	
	// Проверка нескольких старост
																					
	ЗапросСтаросты = Новый Запрос;
	ЗапросСтаросты.МенеджерВременныхТаблиц = МенеджерВТ;
	
	ЗапросСтаросты.Текст = "ВЫБРАТЬ
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Студент КАК Студент
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Староста = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Студент";
	
	ВыборкаСтарост = ЗапросСтаросты.Выполнить().Выбрать();
	
	Если ВыборкаСтарост.Количество() > 1 Тогда
		
		Пока ВыборкаСтарост.Следующий() Цикл
			
			Сообщение = Новый СообщениеПользователю();
			
			Сообщение.Текст = СтрШаблон("В группе может быть только один староста!");
			Сообщение.Поле	= СтрШаблон("Студенты[%1].Староста", ВыборкаСтарост.НомерСтроки - 1);
			
			Сообщение.ПутьКДанным 	= "Объект";
			Сообщение.КлючДанных	= Ссылка;
			
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти